aklofas/urbi-embedded/tests/qemu/reactive_smoke/sdkconfig.defaults
# sdkconfig.defaults — INTERNAL-SRAM smoke preset for QEMU.
#
# Per spec §6.1, espressif/qemu's PSRAM emulation is experimental
# (works for small allocations, not battle-tested at >1 MB), so the
# smoke uses INTERNAL SRAM exclusively.  reactive_smoke_main.c
# installs a local `smoke_alloc` wrapping heap_caps_malloc with
# MALLOC_CAP_INTERNAL rather than the port's PSRAM-backed
# port_psram_alloc.

# Target SoC.  QEMU machine selection happens via `idf.py --preview
# set-target esp32s3` before build; this just locks the kconfig
# branch.
CONFIG_IDF_TARGET="esp32s3"

# 4 MB flash — partitions.csv uses a 1 MB factory app, well under cap.
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y

# PSRAM disabled.  smoke_alloc requests INTERNAL caps so PSRAM init
# is not needed, and skipping it avoids the experimental QEMU
# emulation path.
CONFIG_SPIRAM=n

# 100 Hz tick.  Matches the FreeRTOS scheduler determinism contract
# used throughout the urbi runtime (sched preset CI gates run at
# 100 Hz).
CONFIG_FREERTOS_HZ=100

# Use the custom partition table at partitions.csv (sibling file).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
